In [1]:
# import dependencies
import pandas as pd

In [2]:
# read in csv file as dataframe
file_path = "shopping_data.csv"
df_shopping = pd.read_csv(file_path)
df_shopping.head()

   CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0           1         Yes  19.0          15000                    39.0
1           2         Yes  21.0          15000                    81.0
2           3          No  20.0          16000                     6.0
3           4          No  23.0          16000                    77.0
4           5          No  31.0          17000                    40.0

### What data is available?
---
first, account for the data you have

In [3]:
# Columns
df_shopping.columns

Index(['CustomerID', 'Card Member', 'Age', 'Annual Income',
       'Spending Score (1-100)'],
      dtype='object')

Now start thinking about possible analyses

### What type of data is available?
---
Use `dtypes` method to confirm datatypes
- we need all our columns to be numerical

In [4]:
# list dataframe data types
df_shopping.dtypes

CustomerID                  int64
Card Member                object
Age                       float64
Annual Income               int64
Spending Score (1-100)    float64
dtype: object

Card member column will need to be encoded

### What data is missing?
---
Unsupervised learning models can't handle missing data, if a column has too many missing data points it should be removed from the analysis
- can use `isnull()` to check for missing values
    - loop through each column, check for null values, sum them, and print readable total

In [5]:
# find null values
for column in df_shopping.columns:
    print(f"Column {column} has {df_shopping[column].isnull().sum()} null values")

Column CustomerID has 0 null values
Column Card Member has 2 null values
Column Age has 2 null values
Column Annual Income has 0 null values
Column Spending Score (1-100) has 1 null values

### What data can be removed?
---
since none of the columns are missing too many values, we can use `dropna()`

In [6]:
# drop null rows
df_shopping = df_shopping.dropna()

Use `duplicated().sum()` method to check for duplicates

In [7]:
# find duplicates
print(f"Duplicate entries: {df_shopping.duplicated().sum()}")

Duplicate entries: 0

Since `CustomerID` column does not provide valuable data, we can drop this as well

In [8]:
# remove CustomerId column
df_shopping.drop(columns=['CustomerID'], inplace=True)
df_shopping.head()

  Card Member   Age  Annual Income  Spending Score (1-100)
0         Yes  19.0          15000                    39.0
1         Yes  21.0          15000                    81.0
2          No  20.0          16000                     6.0
3          No  23.0          16000                    77.0
4          No  31.0          17000                    40.0

### Encode Card Member Column to numerical format
---
use function and `.apply` method to change:
- Yes = 1
- Everything else (No) = 0

In [9]:
# transsform string column
def change_string(member):
    if member == "Yes":
        return 1
    else:
        return 0

df_shopping['Card Member'] = df_shopping['Card Member'].apply(change_string)
df_shopping.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0          15000                    39.0
1            1  21.0          15000                    81.0
2            0  20.0          16000                     6.0
3            0  23.0          16000                    77.0
4            0  31.0          17000                    40.0

### Rescale annual income column to be consistent with other columns
---
Divide column by 1000 to rescale data points

In [10]:
# transform annual income
df_shopping['Annual Income'] = df_shopping['Annual Income']/1000
df_shopping.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0           15.0                    39.0
1            1  21.0           15.0                    81.0
2            0  20.0           16.0                     6.0
3            0  23.0           16.0                    77.0
4            0  31.0           17.0                    40.0

In [12]:
# rename columns so there are no spaces or numbers
df_shopping=df_shopping.rename(columns={'Card Member':'card-member','Age':'age','Annual Income':'annual-income','Spending Score (1-100)':'spending-score'})
df_shopping.head()

   card-member   age  annual-income  spending-score
0            1  19.0           15.0            39.0
1            1  21.0           15.0            81.0
2            0  20.0           16.0             6.0
3            0  23.0           16.0            77.0
4            0  31.0           17.0            40.0

In [13]:
# Saving cleaned data
file_path = "shopping_data_cleaned.csv"
df_shopping.to_csv(file_path, index=False)